caAERS/software/jbi/caaers2adeers-sync/caaers-wsbc-su/target/caaers-wsbc-su-2.5-M5-SNAPSHOT-installer/GenericProcessor.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<wsdl:definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://webservice.caaers.cabig.nci.nih.gov/GenericProcessor/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="GenericProcessor" targetNamespace="http://webservice.caaers.cabig.nci.nih.gov/GenericProcessor/">
  <wsdl:types>
    <xsd:schema targetNamespace="http://webservice.caaers.cabig.nci.nih.gov/GenericProcessor/">
      <xsd:element name="GenericRequest">
        <xsd:complexType>
          <xsd:sequence>
          	<xsd:element name="payload">
          		<xsd:complexType>
          			<xsd:sequence>
          				<xsd:element name="system" type="xsd:string" minOccurs="1" maxOccurs="1"/>
          				<xsd:element name="request" type="tns:Request" minOccurs="1" maxOccurs="1"/>
          			</xsd:sequence>
          			<xsd:attribute name="correlationId" type="xsd:string"/>
          		</xsd:complexType>
			</xsd:element>	
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>
      <xsd:element name="GenericResponse">
        <xsd:complexType>
          <xsd:sequence>
          	<xsd:element name="payload">
          		<xsd:complexType>
          			<xsd:sequence>
          				<xsd:element name="system" type="xsd:string" minOccurs="1" maxOccurs="1"/>
          				<xsd:element name="response" type="tns:Response" minOccurs="1" maxOccurs="1"/>
          			</xsd:sequence>
          			<xsd:attribute name="correlationId" type="xsd:string"/>
          		</xsd:complexType>
			</xsd:element>	
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>
      <xsd:complexType name="Request">
			<xsd:sequence>
				<xsd:element minOccurs="0" name="entity" type="xsd:string"></xsd:element>
				<xsd:element name="operation">
					<xsd:complexType>
						<xsd:sequence>
							<xsd:element name="criteria">
								<xsd:complexType>
									<xsd:sequence>
										<xsd:element name="criterion" minOccurs="1" maxOccurs="unbounded">
											<xsd:complexType>
												<xsd:simpleContent>
											      <xsd:extension base="xsd:string">
											        <xsd:attribute name="name" type="xsd:string" />
											      </xsd:extension>
											    </xsd:simpleContent>
											</xsd:complexType>
										</xsd:element>
									</xsd:sequence>
								  </xsd:complexType>
							</xsd:element>
						</xsd:sequence>
						<xsd:attribute name="name" type="xsd:string"/>
						<xsd:attribute name="mode" type="xsd:string"/>
					</xsd:complexType>
				</xsd:element>
			</xsd:sequence>
	  </xsd:complexType>
	  <xsd:complexType name="Response">
			<xsd:sequence>
				<xsd:element minOccurs="0" name="entity" type="xsd:string"></xsd:element>
				<xsd:element name="operation">
					<xsd:complexType>
						<xsd:sequence>
							<xsd:element name="errors">
								<xsd:complexType>
									<xsd:sequence>
										<xsd:element name="error" minOccurs="1" maxOccurs="unbounded" type="xsd:string" />
									</xsd:sequence>
								  </xsd:complexType>
							</xsd:element>
							<xsd:element name="data" minOccurs="0" maxOccurs="1" type="xsd:string" />
						</xsd:sequence>
						<xsd:attribute name="name" type="xsd:string"/>
					</xsd:complexType>
				</xsd:element>
			</xsd:sequence>
	  </xsd:complexType>
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="GenericRequestMessage">
    <wsdl:part element="tns:GenericRequest" name="request"/>
  </wsdl:message>
  <wsdl:message name="GenericResponseMessage">
    <wsdl:part element="tns:GenericResponse" name="response"/>
  </wsdl:message>
  <wsdl:portType name="GenericProcessor">
    <wsdl:operation name="Process">
      <wsdl:input message="tns:GenericRequestMessage"/>
      <wsdl:output message="tns:GenericResponseMessage"/>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="GenericProcessorSOAP" type="tns:GenericProcessor">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="Process">
      <soap:operation soapAction="http://webservice.caaers.cabig.nci.nih.gov/GenericProcessor/Process"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="GenericProcessor">
    <wsdl:port binding="tns:GenericProcessorSOAP" name="GenericProcessorSOAP">
      <soap:address location="https://localhost:8196/GenericProcessorService"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
